// Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3


// let x = 10;
// if (x !== 0) {
//     console.log('Вірно')
// } else {
//     console.log('Невірно')
// }
//
// x = 1;
// if (x !== 0) {
//     console.log('Вірно')
// } else {
//     console.log('Невірно')
// }
//
// x = 0;
// if (x !== 0) {
//     console.log('Вірно')
// } else {
//     console.log('Невірно')
// }
// x = -3;
//
// if (x !== 0) {
//     console.log('Вірно')
// } else {
//     console.log('Невірно')


// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = prompt('Какая четверть?');
// if (time >= 0 && time <= 15) {
//     console.log('Первая четверть')
// }
// else if (time >= 15 && time <= 30) {
//     console.log('Вторая четверть')
// }
// else if (time >= 30 && time <= 45) {
//     console.log('Третья четверть')
// }
// else if (time >= 45 && time <= 59) {
//     console.log('Четвертая четверть')
// }
// else{
//     console.log('???????????')
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Какая декада?')
// if (day >= 1 && day <= 10){
//     console.log('Первая декада')
// } else if (day >= 10 && day <= 20){
//     console.log('Вторая декада')
// } else if (day >= 20 && day <= 31){
//     console.log('Третья декада')
// }




//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

// let day = prompt('Какой день?');
// switch (day) {
//     case '1':
//     console.log('Monday');
//         break;
//     case '2':
//         console.log('Tuesday');
//         break;
//     case '3':
//         console.log('Wednesday');
//         break;
//     case '4':
//         console.log('Thursday');
//         break;
//     case '5':
//         console.log('Friday');
//         break;
//     case '6':
//         console.log('Saturday');
//         break;
//     case '7':
//         console.log('Sunday');
//
// }




//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

// let num1 = +prompt('Число 1?');
// let num2 = +prompt('Число 2?');
//
// if (num1 > num2){
//     console.log('num1 больше, чем num2')
// }
// else if (num2 > num1){
//     console.log('num2 больше, чем num1')
// }
// else if (num1 === num2){
//     console.log('num1 равно num2')
// }


//
//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)

let x = NaN || 'default';
console.log(x)